#include <iostream>

using namespace std;

int main() {
cout << "Лабораторна робота №2 (задача № 30/гр 319 а) Заставського Назара"<< endl;
    int Year;

    // Введення року
    cout << "Введіть номер року: ";
    cin >> Year;

    // Обчислення століття
    int Century = (Year - 1) / 100 + 1;

    // Виведення результату
    cout << "Номер століття: " << Century << endl;

    return 0;
}




#include <iostream> 
using namespace std;

int main() {
    cout << "Лабораторна робота №2 (задача № 35/гр 319 а) Заставського Назара"<< endl;
    // Оголошуємо змінні для координат двох полів шахової дошки
    int x1, y1, x2, y2;
    
    // Вводимо координати першого та другого полів
    cout << "Введіть координати першого та другого полів (х1, у1) та (х2, у2): " ;
    cin >> x1 >> y1 >> x2 >> y2;

    // Перевіряємо, чи мають поля однаковий колір.
    // Поля одного кольору мають однакову парність суми координат.
    bool Result = ((x1 + y1)%2 == (x2 + y2)%2);

    // Виводимо результат:
    // 1 (true) — якщо поля мають однаковий колір
    // 0 (false) — якщо поля мають різний колір
    cout << Result;

    
    return 0;
}




#include <iostream>
#include <cmath>

using namespace std;

int main()
{
    cout << "Лабораторна робота №2 (задача № 15/гр 319 а) Заставського Назара"<< endl;
    // Константа числа π
    const double PI = 3.141592653589793;

    double x, y;

    // Введення значення x
    cout << "Введіть значення змінної x: ";
    cin >> x;

    // Перевіряємо область допустимих значень
    if (x == 0)
    {
        cout << "Помилка: x не може дорівнювати 0." << endl;
        return 1;
    }

    // Переведемо 35 градусів у радіани
    double angle = x + 35.0 * PI / 180.0;

    // Обчислимо вираз
    y = (log(abs(x)) / log(2.0) * pow(sin(angle), 2))
        / (pow(3.0, x - 1.0) *
           cbrt(2.0 * PI + 0.5 * cos(x)));

    // Виведення результату
    cout << "y = " << y << endl;

    return 0;
}